EDT/УТ/src/Reports/ОтчетПоОтказамПереносамНовый/ОтчетПоОтказамПереносамНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоОтказамПереносамНовый</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/РассылкиКонтрагентов/РассылкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РассылкиКонтрагентов</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРассылки</name>
    <type>
      <types>EnumRef.ТипыРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыОтправляемыхОтчетов/ВидыОтправляемыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтправляемыхОтчетов</name>
  <enumValues>
    <name>Приложение4_003</name>
  </enumValues>
  <enumValues>
    <name>ОтчетАгентаДетскийМир</name>
  </enumValues>
  <enumValues>
    <name>ОтчетАгентаПоНоменклатурныйReStore</name>
  </enumValues>
  <enumValues>
    <name>РасшифровкаБанковскихПереводов_003</name>
  </enumValues>
  <enumValues>
    <name>Enter_003</name>
  </enumValues>
  <enumValues>
    <name>Enter_3_Итоговый</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоКачествуДоставокДляПартнера</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоКачествуДоставокДляПартнераПереносы</name>
  </enumValues>
  <enumValues>
    <name>TopDelivery_ОтчетАгента_XML</name>
  </enumValues>
  <enumValues>
    <name>НенайденныеДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоСтоимостиТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОНеобеспеченныхЗаказах</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОНеобеспеченныхЗаказахКомитентам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетММ_003</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоСкладамМагазинов</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоДоставкамКомитента</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоНеуехавшимЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоКоличествуПоездок</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоВесам</name>
  </enumValues>
  <enumValues>
    <name>ЕжедневныйОтчетОКачествеДоставок</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоОтказамПереносам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоКонтролюВремени</name>
  </enumValues>
  <enumValues>
    <name>РеестрПКЭкспресс</name>
  </enumValues>
  <enumValues>
    <name>КачествоДоставкиЛореаль</name>
  </enumValues>
  <enumValues>
    <name>СписокЗаказовСНепривязаннымиАдресами</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоНеПолностьюПоступившимЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоИнтервалам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоНеПолностьюПоступившимЗаказамКомитентам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетАгентаУниверсальный</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоКИК</name>
  </enumValues>
  <enumValues>
    <name>ГрафикРаботыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоАвтопереносуДатыДоставкиПриПоступлении</name>
  </enumValues>
  <enumValues>
    <name>СводОтправленныхРассылок</name>
  </enumValues>
  <enumValues>
    <name>ДетализацияОплатКомитентам</name>
  </enumValues>
  <enumValues>
    <name>РассылкаВН</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйЖурналВыдачиОборудования</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоВесамЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаПропуск</name>
  </enumValues>
  <enumValues>
    <name>МониторингОтказовПереносовРасширенный</name>
  </enumValues>
  <enumValues>
    <name>ПланФактКонтроляМаршрутизации</name>
  </enumValues>
  <enumValues>
    <name>СводПоВозвратнымНакладным</name>
  </enumValues>
  <enumValues>
    <name>СписокОтсутствующихВСистемеГМ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоИдентичнымАдресам</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПоМассивнымЗаказам</name>
  </enumValues>
  <enumValues>
    <name>СборкаЗаказов</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыРассылки/ТипыРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРассылки</name>
  <enumValues>
    <name>АдминистративнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ТехническаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ФинансоваяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаАктовПриемаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗаборнаяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>КонтрольЗаказов</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/РегиональныеТерминалы/РегиональныеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегиональныеТерминалы</name>
  <predefined>
    <items>
      <name>МоскваСтриж</name>
      <description>Москва Стриж</description>
    </items>
    <items>
      <name>СПбСтриж</name>
      <description>СПб Стриж</description>
    </items>
  </predefined>
  <attributes>
    <name>КодТерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическаяЗонаДоставки</name>
    <type>
      <types>CatalogRef.новаРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакрытияОперДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеглЗаданиеЗакрытиеОперДня</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксАдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраБоевогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраТестовогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаСтаршегоЛогиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиЧековРМЭкипажа</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверККМ</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_ОсновнойРаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ТипыОтправкиОтчетов/ТипыОтправкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОтправкиОтчетов</name>
  <predefined>
    <items>
      <name>ОтчетВнутреннийПочтойПользователь</name>
      <description>Внутренний отчет (почтой, пользователь)</description>
    </items>
    <items>
      <name>ОтчетВнутреннийПочтойРегламент</name>
      <description>Внутренний отчет (почтой, регламент)</description>
    </items>
    <items>
      <name>ОтчетПартнерамWEBСервис</name>
      <description>Отчет партнерам (WEBСервис, Админка)</description>
    </items>
    <items>
      <name>ОтчетПартнерамПочтойПользователь</name>
      <description>Отчет партнерам (почтой, пользователь)</description>
    </items>
    <items>
      <name>ОтчетПартнерамПочтойРегламент</name>
      <description>Отчет партнерам (почтой, регламент)</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Reports/ОтчетПоОтказамПереносамНовый/ObjectModule.bsl
Процедура ОтправитьОтчетПоРегламенту(ДатаНач, ДатаКон, Терминал = Неопределено, МасП, НастройкаОтправки = Неопределено) Экспорт
	ОтправитьПоПочтеНаСервере(Истина, ДатаНач, ДатаКон, Терминал, НастройкаОтправки);
	ОтправитьПоПочтеРуководству(Истина, ДатаНач, ДатаКон, Терминал, МасП, НастройкаОтправки);
КонецПроцедуры	

Процедура ОтправитьПоПочтеРуководству(ОтправкаПоРегламенту = Ложь, ДатаНач = Неопределено, ДатаКон = Неопределено, Терминал = Неопределено, МасП = Неопределено, НастройкаОтправки = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("НоваяСхемаКомпоновки");
	ВариантОтправки = СхемаКомпоновкиДанных.ВариантыНастроек.ДляПочтыРуководству;

	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтправки.Настройки);
	
	Если НЕ  Терминал = Неопределено Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Терминал);
	Иначе
		Терминал = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТерминалДоставки").Значение;
	КонецЕсли;	
	
	Если Не ОтправкаПоРегламенту И НЕ ЗначениеЗаполнено(Терминал) Тогда					
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Справочники.РегиональныеТерминалы.МоскваСтриж);
	Иначе		
		Если  Не (ДатаНач = Неопределено И ДатаКон = Неопределено) Тогда		
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета", новый Стандартныйпериод(НачалоДня(ДатаНач), КонецДня(ДатаКон)));
		Иначе			
			ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение;
			ДатаНач = ПериодОтчета.ДатаНачала;
			ДатаКон = ПериодОтчета.ДатаОкончания;			
		КонецЕсли;		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьЗаголовок").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьОтбор").Использование = Истина;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьПараметрыДанных").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьПараметрыДанных").Использование = Истина;
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);

	Результат = Новый ТабличныйДокумент;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Г = Новый УникальныйИдентификатор;
	ПутьКФайлу = КаталогВременныхФайлов() + СокрЛП(Строка(Терминал.Город)) + "_ОтчетПоОтказамПереносам_" + ПредставлениеПериода(ДатаНач, ДатаКон, "ДФ=yyyy-MM-dd") + ".xls"; 	
	Результат.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
	Т = Новый ТекстовыйДокумент();
	Т.Прочитать(ПутьКФайлу);
	
	Стр = "Отчет по отказам/переносам за " + ПредставлениеПериода(ДатаНач, ДатаКон, "ДЛФ=DD") + " (" + Терминал.Город + ")";

	Если МасП = Неопределено Тогда
		
		МасП = Новый Массив;	
		
		МасП.Добавить("rea@strizh-logistic.ru");
		МасП.Добавить("dmitry.sherbinkin@strizh-logistic.ru");
		МасП.Добавить("logist@strizh-logistic.ru");
		МасП.Добавить("alexey.kuzmichev@strizh-logistic.ru");
		МасП.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		МасП.Добавить("sergey.andrienko@strizh-logistic.ru");
		МасП.Добавить("inna.illarionova@strizh-logistic.ru");
		МасП.Добавить("syn@strizh-logistic.ru");
		МасП.Добавить("denis.zherebtsov@strizh-logistic.ru");
		МасП.Добавить("v.yakurnov@strizh-logistic.ru");
		МасП.Добавить("stanislav.tumakov@strizh-logistic.ru");
		//МасП.Добавить("daria.sladkova@strizh-logistic.ru");
		МасП.Добавить("i.belov@strizh-logistic.ru");	
		
	КонецЕсли;
	
	#Область ОтправкаИЛогирование
	
	Стр_ = СтрСоединить(МасП, "; ");

	Если Не НастройкаОтправки = Неопределено И ОтправкаПоРегламенту = Истина Тогда
		
		ПараметрыЗаписи = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаОтправкиОтчета(Справочники.ТипыОтправкиОтчетов.ОтчетВнутреннийПочтойРегламент);
		ПараметрыЗаписи.ВидОтчета = НастройкаОтправки.Отчет;
		ПараметрыЗаписи.НастройкаОтправки = НастройкаОтправки;
		ПараметрыЗаписи.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		
	Иначе
		
		ПараметрыЗаписи = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаОтправкиОтчета(Справочники.ТипыОтправкиОтчетов.ОтчетВнутреннийПочтойПользователь);
		ПараметрыЗаписи.ВидОтчета = Перечисления.ВидыОтправляемыхОтчетов.ОтчетПоОтказамПереносам;
		ПараметрыЗаписи.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		
		Если НЕ НастройкаОтправки = Неопределено тогда
			ПараметрыЗаписи.НастройкаОтправки = НастройкаОтправки;
		КонецЕсли;

	КонецЕсли;
	
	ПараметрыЗаписи.Терминал = Терминал;
	
	ПараметрыЗаписи.ПериодФормирования = ТекущаяДата();
	
	ПараметрыЗаписи.ДвоичныеДанныеВыгрузки = Новый ДвоичныеДанные(ПутьКФайлу);
	ПараметрыЗаписи.GUID = Г;
	ПараметрыЗаписи.СписокПолучателей = Стр_;
	
	Если Не ВнешнееЛогированиеСервер.ОтчетОтправлялся(ПараметрыЗаписи) Тогда
		ПараметрыЗаписи.ОтчетОтправлен = lem.ОтправитьСообщение(МасП, Стр, Стр, ПутьКФайлу, "Логистическая компания ""Стриж""") ;		
		РезультатЛогирования = ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаОтчетыКОтправке(ПараметрыЗаписи);
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ОтправитьПоПочтеНаСервере(ОтправкаПоРегламенту = Ложь, ДатаНач = Неопределено, ДатаКон = Неопределено, Терминал = Неопределено, НастройкаОтправки = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("НоваяСхемаКомпоновки");
	ВариантОтправки = СхемаКомпоновкиДанных.ВариантыНастроек.ДляПочты;
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		
		СписокКонтрагентовДляОтправки = Новый ТаблицаЗначений;
		СписокКонтрагентовДляОтправки.Колонки.Добавить("ИнтернетМагазин");
		
		СтрокаИМ = СписокКонтрагентовДляОтправки.Добавить();
		СтрокаИМ.ИнтернетМагазин = Справочники.Контрагенты.НайтиПоКоду("Shop_601");
		
		СтрокаИМ = СписокКонтрагентовДляОтправки.Добавить();
		СтрокаИМ.ИнтернетМагазин = Справочники.Контрагенты.НайтиПоКоду("Shop_723");

	Иначе
		СписокКонтрагентовДляОтправки = ПолучитьСписокКонтрагентовДляОтправки(ОтправкаПоРегламенту, ДатаНач, ДатаКон, Терминал, НастройкаОтправки);
	КонецЕсли;
	
	
	МасК = СписокКонтрагентовДляОтправки.ВыгрузитьКолонку("ИнтернетМагазин");
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	РассылкиКонтрагентов.Почта КАК Почта,
	|	РассылкиКонтрагентов.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
	|ГДЕ
	|	РассылкиКонтрагентов.ТипРассылки = &ТипРассылки
	|	И РассылкиКонтрагентов.Контрагент В(&МасК)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Почта";
	Зап.УстановитьПараметр("ТипРассылки", Перечисления.ТипыРассылки.ЛогистическаяРассылка);			
	Зап.УстановитьПараметр("МасК", МасК);
	СписокПочты = Зап.Выполнить().Выгрузить();

	
	Для Каждого СтрокаСписка Из СписокКонтрагентовДляОтправки Цикл
		
		ОтправитьПоПочтеКонтрагенту(СтрокаСписка.ИнтернетМагазин, СписокПочты, ОтправкаПоРегламенту, ДатаНач, ДатаКон, Терминал, НастройкаОтправки);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтправитьПоПочтеКонтрагенту(ИнтернетМагазин, СписокПочты, ОтправкаПоРегламенту = Ложь, ДатаНач = Неопределено, ДатаКон = Неопределено, Терминал = Неопределено, НастройкаОтправки = Неопределено)
	
	СхемаКомпоновкиДанных = ПолучитьМакет("НоваяСхемаКомпоновки");

	Если СокрЛП(ИнтернетМагазин.Код) = "Shop_601" ИЛИ СокрЛП(ИнтернетМагазин.Код) = "Shop_752" Тогда
		ВариантОтправки = СхемаКомпоновкиДанных.ВариантыНастроек.ДляПочтыЯндекс;
	Иначе	
		ВариантОтправки = СхемаКомпоновкиДанных.ВариантыНастроек.ДляПочты;
	КонецеСли;	
	
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтправки.Настройки);
	
	Если НЕ  Терминал = Неопределено Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Терминал);
	Иначе
		Терминал = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТерминалДоставки").Значение;
	КонецЕсли;	
	
	Если Не ОтправкаПоРегламенту И НЕ ЗначениеЗаполнено(Терминал) Тогда					
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Справочники.РегиональныеТерминалы.МоскваСтриж);
	Иначе		
		Если  Не (ДатаНач = Неопределено И ДатаКон = Неопределено) Тогда		
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета", новый Стандартныйпериод(НачалоДня(ДатаНач), КонецДня(ДатаКон)));
		Иначе			
			ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение;
			ДатаНач = ПериодОтчета.ДатаНачала;
			ДатаКон = ПериодОтчета.ДатаОкончания;			
		КонецЕсли;		
	КонецЕсли;
	
	ИнтернетМагазинПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИнтернетМагазин");
	ИнтернетМагазинПараметр.Значение = ИнтернетМагазин;
	ИнтернетМагазинПараметр.Использование = Истина;	

	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьЗаголовок").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьОтбор").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьОтбор").Использование = Истина;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("МакетОформления").Значение = "Арктика";
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("МакетОформления").Использование = Истина;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьПараметрыДанных").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	КомпоновщикНастроек.Настройки.Параметрывывода.элементы.найти("ВыводитьПараметрыДанных").Использование = Истина;
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));	

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;

	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	УдаляемаяОбласть = Результат.Область("R1:R"+Результат.ФиксацияСверху);
	Результат.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
	Если Результат.ВысотаТаблицы > 2 Тогда
		Г = Новый УникальныйИдентификатор;
		
		ПутьКФайлу = КаталогВременныхФайлов() + "report_f_t_" + ПредставлениеПериода(ДатаНач, ДатаКон, "ДФ=yyyy-MM-dd") + ".xls";  
		Стр = "Отчет по отказам/переносам за " + ПредставлениеПериода(ДатаНач, ДатаКон, "ДЛФ=DD") + " (" + Терминал.Город + ")";
		
		Результат.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
		МасП = Новый Массив;
		МасП.Добавить("logist@strizh-logistic.ru"); 
		
		Струк = Новый Структура;
		Струк.Вставить("Контрагент", ИнтернетМагазин);
		НайСтроки = СписокПочты.НайтиСтроки(Струк);
		Для Сч = 0 По НайСтроки.Количество() - 1 Цикл			
			МасП.Добавить(НайСтроки[Сч].Почта);
		КонецЦикла;	
		
		Стр_ = СтрСоединить(МасП, "; ");
		
		КонтрагентДляРассылки = ИнтернетМагазин;
		
		Если Не НастройкаОтправки = Неопределено И ОтправкаПоРегламенту = Истина Тогда
			
			ПараметрыЗаписи = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаОтправкиОтчета(Справочники.ТипыОтправкиОтчетов.ОтчетПартнерамПочтойРегламент);
			ПараметрыЗаписи.ВидОтчета = НастройкаОтправки.Отчет;
			ПараметрыЗаписи.НастройкаОтправки = НастройкаОтправки;
			ПараметрыЗаписи.Контрагент = КонтрагентДляРассылки;
			
		Иначе
			
			ПараметрыЗаписи = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаОтправкиОтчета(Справочники.ТипыОтправкиОтчетов.ОтчетПартнерамПочтойПользователь);
			ПараметрыЗаписи.ВидОтчета = Перечисления.ВидыОтправляемыхОтчетов.ОтчетПоОтказамПереносам;
			ПараметрыЗаписи.Контрагент = КонтрагентДляРассылки;
			
			Если НЕ НастройкаОтправки = Неопределено тогда
				ПараметрыЗаписи.НастройкаОтправки = НастройкаОтправки;
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыЗаписи.ПериодФормирования = ТекущаяДата();
		
		ПараметрыЗаписи.ДвоичныеДанныеВыгрузки = Новый ДвоичныеДанные(ПутьКФайлу);
		ПараметрыЗаписи.GUID = Г;
		ПараметрыЗаписи.СписокПолучателей = Стр_;
		
		ПараметрыЗаписи.Терминал = Терминал; 
		
		Если Не ВнешнееЛогированиеСервер.ОтчетОтправлялся(ПараметрыЗаписи) Тогда
			ПараметрыЗаписи.ОтчетОтправлен = lem.ОтправитьСообщение(МасП, Стр, Стр, ПутьКФайлу, "Логистическая компания ""Стриж""");
			
			РезультатЛогирования = ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаОтчетыКОтправке(ПараметрыЗаписи);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокКонтрагентовДляОтправки(ОтправкаПоРегламенту = Ложь, ДатаНач = Неопределено, ДатаКон = Неопределено, Терминал = Неопределено, НастройкаОтправки = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("НоваяСхемаКомпоновки");
	ВариантОтправки = СхемаКомпоновкиДанных.ВариантыНастроек.ДляПочты;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтправки.Настройки);
	
	Если НЕ  Терминал = Неопределено Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Терминал);
	Иначе
		Терминал = КомпоновщикНастроек.Настройки.ПараметрыДанных.Терминал;
	КонецЕсли;	
	
	Если Не ОтправкаПоРегламенту И НЕ ЗначениеЗаполнено(Терминал) Тогда					
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТерминалДоставки", Справочники.РегиональныеТерминалы.МоскваСтриж);
	Иначе		
		Если  Не (ДатаНач = Неопределено И ДатаКон = Неопределено) Тогда		
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета", новый Стандартныйпериод(НачалоДня(ДатаНач), КонецДня(ДатаКон)));
		Иначе			
			ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение;
			ДатаНач = ПериодОтчета.ДатаНачала;
			ДатаКон = ПериодОтчета.ДатаОкончания;			
		КонецЕсли;		
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	//Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));
	Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;

	Таб = Новый ДеревоЗначений;
	//Таб = Новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьОбъект(Таб);	
	//ПроцессорВывода.УстановитьДокумент(Таб);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат Таб.Строки;
	
КонецФункции
